; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-7)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	)
(:init
	(at plane1 city4)
	(= (capacity plane1) 14715)
	(= (fuel plane1) 3030)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 14)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 10)
	(at plane2 city4)
	(= (capacity plane2) 11684)
	(= (fuel plane2) 3299)
	(= (slow-burn plane2) 4)
	(= (fast-burn plane2) 14)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 8)
	(at plane3 city0)
	(= (capacity plane3) 8790)
	(= (fuel plane3) 324)
	(= (slow-burn plane3) 3)
	(= (fast-burn plane3) 10)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 3)
	(at plane4 city1)
	(= (capacity plane4) 5679)
	(= (fuel plane4) 1030)
	(= (slow-burn plane4) 2)
	(= (fast-burn plane4) 5)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 9)
	(at plane5 city1)
	(= (capacity plane5) 7180)
	(= (fuel plane5) 215)
	(= (slow-burn plane5) 3)
	(= (fast-burn plane5) 10)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 2)
	(at person1 city3)
	(at person2 city2)
	(at person3 city4)
	(at person4 city1)
	(at person5 city2)
	(at person6 city1)
	(at person7 city0)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 518)
	(= (distance city0 city2) 557)
	(= (distance city0 city3) 675)
	(= (distance city0 city4) 815)
	(= (distance city1 city0) 518)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 874)
	(= (distance city1 city3) 500)
	(= (distance city1 city4) 649)
	(= (distance city2 city0) 557)
	(= (distance city2 city1) 874)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 783)
	(= (distance city2 city4) 816)
	(= (distance city3 city0) 675)
	(= (distance city3 city1) 500)
	(= (distance city3 city2) 783)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 803)
	(= (distance city4 city0) 815)
	(= (distance city4 city1) 649)
	(= (distance city4 city2) 816)
	(= (distance city4 city3) 803)
	(= (distance city4 city4) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city4)
	(at plane2 city0)
	(at plane3 city0)
	(at plane5 city0)
	(at person1 city4)
	(at person2 city1)
	(at person3 city2)
	(at person4 city0)
	(at person5 city3)
	(at person6 city0)
	(at person7 city3)
	))

(:metric minimize (+ (* 1 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (refuel plane5 city1)
   changed: (fuel plane5) from 215 to 7180
   goals met: 2 of 11
2. (board person4 plane5 city1)
   deleted: (at person4 city1)
   added: (in person4 plane5)
   changed: (onboard plane5) from 0 to 1
   goals met: 2 of 11
3. (board person6 plane5 city1)
   deleted: (at person6 city1)
   added: (in person6 plane5)
   changed: (onboard plane5) from 1 to 2
   goals met: 2 of 11
4. (zoom plane5 city1 city0)
   deleted: (at plane5 city1)
   added: (at plane5 city0)
   changed: (total-fuel-used) from 0 to 5180, (fuel plane5) from 7180 to 2000
   goals met: 3 of 11
5. (debark person4 plane5 city0)
   deleted: (in person4 plane5)
   added: (at person4 city0)
   changed: (onboard plane5) from 2 to 1
   goals met: 4 of 11
6. (board person3 plane2 city4)
   deleted: (at person3 city4)
   added: (in person3 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 4 of 11
7. (refuel plane4 city1)
   changed: (fuel plane4) from 1030 to 5679
   goals met: 4 of 11
8. (zoom plane4 city1 city3)
   deleted: (at plane4 city1)
   added: (at plane4 city3)
   changed: (total-fuel-used) from 5180 to 7680, (fuel plane4) from 5679 to 3179
   goals met: 4 of 11
9. (board person1 plane4 city3)
   deleted: (at person1 city3)
   added: (in person1 plane4)
   changed: (onboard plane4) from 0 to 1
   goals met: 4 of 11
10. (fly plane4 city3 city4)
   deleted: (at plane4 city3)
   added: (at plane4 city4)
   changed: (total-fuel-used) from 7680 to 9286, (fuel plane4) from 3179 to 1573
   goals met: 4 of 11
11. (debark person6 plane5 city0)
   deleted: (in person6 plane5)
   added: (at person6 city0)
   changed: (onboard plane5) from 1 to 0
   goals met: 5 of 11
12. (debark person1 plane4 city4)
   deleted: (in person1 plane4)
   added: (at person1 city4)
   changed: (onboard plane4) from 1 to 0
   goals met: 6 of 11
13. (fly plane2 city4 city2)
   deleted: (at plane2 city4)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 9286 to 12550, (fuel plane2) from 3299 to 35
   goals met: 6 of 11
14. (refuel plane2 city2)
   changed: (fuel plane2) from 35 to 11684
   goals met: 6 of 11
15. (debark person3 plane2 city2)
   deleted: (in person3 plane2)
   added: (at person3 city2)
   changed: (onboard plane2) from 1 to 0
   goals met: 7 of 11
16. (board person2 plane2 city2)
   deleted: (at person2 city2)
   added: (in person2 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 7 of 11
17. (fly plane2 city2 city1)
   deleted: (at plane2 city2)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 12550 to 16046, (fuel plane2) from 11684 to 8188
   goals met: 7 of 11
18. (debark person2 plane2 city1)
   deleted: (in person2 plane2)
   added: (at person2 city1)
   changed: (onboard plane2) from 1 to 0
   goals met: 8 of 11
19. (fly plane2 city1 city0)
   deleted: (at plane2 city1)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 16046 to 18118, (fuel plane2) from 8188 to 6116
   goals met: 9 of 11
20. (board person7 plane2 city0)
   deleted: (at person7 city0)
   added: (in person7 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 9 of 11
21. (fly plane2 city0 city2)
   deleted: (at plane2 city0)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 18118 to 20346, (fuel plane2) from 6116 to 3888
   goals met: 8 of 11
22. (board person5 plane2 city2)
   deleted: (at person5 city2)
   added: (in person5 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 8 of 11
23. (fly plane2 city2 city3)
   deleted: (at plane2 city2)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 20346 to 23478, (fuel plane2) from 3888 to 756
   goals met: 8 of 11
24. (debark person5 plane2 city3)
   deleted: (in person5 plane2)
   added: (at person5 city3)
   changed: (onboard plane2) from 2 to 1
   goals met: 9 of 11
25. (debark person7 plane2 city3)
   deleted: (in person7 plane2)
   added: (at person7 city3)
   changed: (onboard plane2) from 1 to 0
   goals met: 10 of 11
26. (refuel plane2 city3)
   changed: (fuel plane2) from 756 to 11684
   goals met: 10 of 11
27. (zoom plane2 city3 city0)
   deleted: (at plane2 city3)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 23478 to 32928, (fuel plane2) from 11684 to 2234
   goals met: 11 of 11
